[
    {
        "title": ": Lumma Stealer infection with follow-up Rsockstun malware",
        "link": "https://www.malware-traffic-analysis.net/2025/07/02/index.html",
        "summary": "",
        "published": "2025-07-03"
    },
    {
        "title": ": Lumma Stealer infection with follow-up Rsockstun malware",
        "link": "https://www.malware-traffic-analysis.net/2025/06/26/index.html",
        "summary": "",
        "published": "2025-06-27"
    },
    {
        "title": "New Phishing Attack Mimics Facebook Login Page to Steal Credentials",
        "link": "https://cybersecuritynews.com/new-phishing-attack-mimics-facebook-login-page/",
        "summary": "A rapidly evolving campaign is using a Browser-in-the-Browser (BitB) overlay to impersonate Facebook’s login and siphon user credentials. The lure hinges on a deceptive CAPTCHA challenge that seamlessly morphs into a counterfeit Facebook session window, duping victims across desktops and mobile browsers alike. The malware surfaced on 24 July 2025 when multiple redirection chains began […]\nThe post New Phishing Attack Mimics Facebook Login Page to Steal Credentials appeared first on Cyber Security News.",
        "published": "2025-07-25"
    },
    {
        "title": "Malicious Android Apps Mimic as Popular Indian Banking Apps Steal Login Credentials",
        "link": "https://cybersecuritynews.com/malicious-android-apps-mimic-as-popular-indian-banking-apps/",
        "summary": "Attackers are weaponizing India’s appetite for mobile banking by circulating counterfeit Android apps that mimic the interfaces and icons of public-sector and private banks. Surfacing in telemetry logs on 3 April 2025, the impostors travel through smishing texts, QR codes and search-engine poisoning, tricking users into sideloading the packages. During the initial execution window, a […]\nThe post Malicious Android Apps Mimic as Popular Indian Banking Apps Steal Login Credentials appeared first on Cyber Security News.",
        "published": "2025-07-25"
    },
    {
        "title": "Fire Ant Hackers Exploiting Vulnerabilities in VMware ESXi and vCenter to Infiltrate Organizations",
        "link": "https://cybersecuritynews.com/vmware-esxi-and-vcenter-exploited/",
        "summary": "A sophisticated espionage campaign dubbed “Fire Ant” demonstrates previously unknown capabilities in compromising VMware virtualization infrastructure.  Since early 2025, this threat actor has systematically targeted VMware ESXi hosts, vCenter servers, and network appliances using hypervisor-level techniques that evade traditional endpoint security solutions.  The campaign exhibits strong technical overlap with the previously identified UNC3886 threat group, […]\nThe post Fire Ant Hackers Exploiting Vulnerabilities in VMware ESXi and vCenter to Infiltrate Organizations appeared first on Cyber Security News.",
        "published": "2025-07-25"
    },
    {
        "title": "New Malware Attack Leverages YouTube Channels and Discord to Harvest Credentials from Computer",
        "link": "https://cybersecuritynews.com/new-malware-attack-leverages-youtube-channels-and-discord/",
        "summary": "A newly uncovered campaign is exploiting gamers’ enthusiasm for off-beat indie titles to plant credential-stealing malware on machines. Branded installers for nonexistent games such as “Baruda Quest,” “Warstorm Fire,” and “Dire Talon” are pushed through slick YouTube trailers and Discord download links that imitate legitimate early-access promotions. The lures contain Electron-based executables weighing 80 MB […]\nThe post New Malware Attack Leverages YouTube Channels and Discord to Harvest Credentials from Computer appeared first on Cyber Security News.",
        "published": "2025-07-25"
    },
    {
        "title": "xonPlus Launches Real-Time Breach Alerting Platform For Enterprise Credential Exposure",
        "link": "https://cybersecuritynews.com/xonplus-launches-real-time-breach-alerting-platform-for-enterprise-credential-exposure/",
        "summary": "Chennai, India, July 25th, 2025, CyberNewsWire xonPlus, a real-time digital risk alerting system, officially launches today to help security teams detect credential exposures before attackers exploit them. The platform detects data breaches and alerts teams and systems to respond instantly. Built by the team behind XposedOrNot, an open-source breach detection tool used by thousands, xonPlus […]\nThe post xonPlus Launches Real-Time Breach Alerting Platform For Enterprise Credential Exposure appeared first on Cyber Security News.",
        "published": "2025-07-25"
    },
    {
        "title": "Hackers Exploiting Sharepoint 0-day Vulnerability to Deploy Warlock Ransomware",
        "link": "https://cybersecuritynews.com/sharepoint-0-day-ransomware-attack/",
        "summary": "Microsoft has issued urgent warnings about active exploitation of critical SharePoint vulnerabilities CVE-2025-53770 and CVE-2025-53771 by multiple threat actors, including the China-based group Storm-2603, which has been deploying Warlock ransomware in compromised environments.  The vulnerabilities affect on-premises SharePoint Server 2016, 2019, and Subscription Edition, with exploitation attempts observed as early as July 7, 2025. Key […]\nThe post Hackers Exploiting Sharepoint 0-day Vulnerability to Deploy Warlock Ransomware appeared first on Cyber Security News.",
        "published": "2025-07-25"
    },
    {
        "title": "New CastleLoader Attack Using Cloudflare-Themed Clickfix Technique to Infect Windows Computers",
        "link": "https://cybersecuritynews.com/castleloader-attack-using-cloudflare-themed-clickfix-technique/",
        "summary": "CastleLoader, a rapidly evolving loader discovered in 2025, has surged across underground networks by weaponizing Cloudflare-themed “Clickfix” phishing pages and doctored GitHub repositories to compromise Windows hosts. The malware masquerades as benign developer resources, browser updates, or meeting portals, luring unsuspecting users into copying a seemingly innocent PowerShell command that promises to “verify” or “repair” […]\nThe post New CastleLoader Attack Using Cloudflare-Themed Clickfix Technique to Infect Windows Computers appeared first on Cyber Security News.",
        "published": "2025-07-25"
    },
    {
        "title": "Hive0156 Hackers Attacking Government and Military Organizations to Deploy Remcos RAT",
        "link": "https://cybersecuritynews.com/hive0156-hackers-attacking-government/",
        "summary": "A sophisticated Russian-aligned threat actor known as Hive0156 has intensified its cyber espionage campaigns against Ukrainian government and military organizations, deploying the notorious Remcos Remote Access Trojan through carefully crafted social engineering attacks. The group has demonstrated remarkable persistence in targeting Ukraine’s defense infrastructure throughout 2025, utilizing weaponized Microsoft LNK files and PowerShell scripts as […]\nThe post Hive0156 Hackers Attacking Government and Military Organizations to Deploy Remcos RAT appeared first on Cyber Security News.",
        "published": "2025-07-25"
    },
    {
        "title": "Rise in Phishing Activity Using Spoofed SharePoint Domains With Sneaky2FA Techniques",
        "link": "https://cybersecuritynews.com/rise-in-phishing-activity-using-spoofed-sharepoint-domains/",
        "summary": "Spoofed Microsoft SharePoint notifications have been a familiar lure for corporate users, but a wave of campaigns traced between March and July 2025 shows a sharp uptick in both volume and sophistication. The operators register look-alike domains such as “sharepoint-online-docs-secure[.]co” and “files-share-portal-m365[.]io,” then embed them in convincing e-mails that pass SPF and DKIM checks, slipping […]\nThe post Rise in Phishing Activity Using Spoofed SharePoint Domains With Sneaky2FA Techniques appeared first on Cyber Security News.",
        "published": "2025-07-25"
    },
    {
        "title": "BlackSuit Ransomware’s Data Leak and Negotiation Portal Seized",
        "link": "https://cybersecuritynews.com/blacksuit-ransomware-portal-seized/",
        "summary": "A major win against cybercrime happened this week, as authorities from around the world teamed up to take down key websites run by the BlackSuit ransomware gang. If you visit the group’s data leak site or their negotiation portal now, you’ll only see a large notice stating that the site has been seized by law […]\nThe post BlackSuit Ransomware’s Data Leak and Negotiation Portal Seized appeared first on Cyber Security News.",
        "published": "2025-07-25"
    },
    {
        "title": "UK Student Sentenced to Prison for Selling Phishing Kits",
        "link": "https://www.securityweek.com/uk-student-sentenced-to-prison-for-selling-phishing-kits/",
        "summary": "Ollie Holman was sentenced to prison for selling over 1,000 phishing kits that caused estimated losses of over $134 million.\nThe post UK Student Sentenced to Prison for Selling Phishing Kits appeared first on SecurityWeek.",
        "published": "2025-07-25"
    },
    {
        "title": "Chinese Spies Target Networking and Virtualization Flaws to Breach Isolated Environments",
        "link": "https://www.securityweek.com/chinese-spies-target-networking-and-virtualization-flaws-to-breach-isolated-environments/",
        "summary": "Chinese cyberespionage group Fire Ant is targeting virtualization and networking infrastructure to access isolated environments.\nThe post Chinese Spies Target Networking and Virtualization Flaws to Breach Isolated Environments appeared first on SecurityWeek.",
        "published": "2025-07-25"
    },
    {
        "title": "No Patch for Flaw Exposing Hundreds of LG Cameras to Remote Hacking",
        "link": "https://www.securityweek.com/no-patch-for-flaw-exposing-hundreds-of-lg-cameras-to-remote-hacking/",
        "summary": "LG Innotek LNV5110R security cameras are affected by a vulnerability that can be exploited for unauthenticated remote code execution.\nThe post No Patch for Flaw Exposing Hundreds of LG Cameras to Remote Hacking appeared first on SecurityWeek.",
        "published": "2025-07-25"
    },
    {
        "title": "$15M Rewards Offered as American Woman Jailed in IT Worker Scam",
        "link": "https://www.securityweek.com/us-targets-north-koreas-illicit-funds-15m-rewards-offered-as-american-woman-jailed-in-it-worker-scam/",
        "summary": "Christina Chapman was sentenced to prison for helping North Korean IT workers infiltrate US companies and running a laptop farm for them.\nThe post US Targets North Korea’s Illicit Funds: $15M Rewards Offered as American Woman Jailed in IT Worker Scam appeared first on SecurityWeek.",
        "published": "2025-07-25"
    },
    {
        "title": "Clorox Sues Cognizant for $380 Million Over 2023 Hack",
        "link": "https://www.securityweek.com/clorox-sues-cognizant-for-380-million-over-2023-hack/",
        "summary": "Clorox is blaming Congnizat for the 2023 cyberattack, claiming that the IT provided handed over passwords to the hackers.\nThe post Clorox Sues Cognizant for $380 Million Over 2023 Hack appeared first on SecurityWeek.",
        "published": "2025-07-24"
    },
    {
        "title": "High-Value NPM Developers Compromised in New Phishing Campaign",
        "link": "https://www.securityweek.com/high-value-npm-developers-compromised-in-new-phishing-campaign/",
        "summary": "Hackers have injected malware into popular NPM packages after compromising several developer accounts in a fresh phishing campaign.\nThe post High-Value NPM Developers Compromised in New Phishing Campaign appeared first on SecurityWeek.",
        "published": "2025-07-24"
    },
    {
        "title": "SonicWall Patches Critical SMA 100 Vulnerability, Warns of Recent Malware Attack",
        "link": "https://www.securityweek.com/sonicwall-patches-critical-sma-100-vulnerability-warns-of-recent-malware-attack/",
        "summary": "SonicWall advises organizations to patch SMA 100 appliances and look for IoCs associated with Overstep malware attacks.\nThe post SonicWall Patches Critical SMA 100 Vulnerability, Warns of Recent Malware Attack appeared first on SecurityWeek.",
        "published": "2025-07-24"
    },
    {
        "title": "Law Enforcement Cracks Down on XSS — but Will It Last?",
        "link": "https://www.darkreading.com/threat-intelligence/law-enforcement-cracks-down-xss",
        "summary": "The arrest of a suspected administrator for the popular cybercrime forum was one of several enforcement actions in the past week targeting malicious activity.",
        "published": "2025-07-24"
    },
    {
        "title": "Ransomware Actors Pile on 'ToolShell' SharePoint Bugs",
        "link": "https://www.darkreading.com/endpoint-security/ransomware-actors-toolshell-sharepoint-bugs",
        "summary": "Storm-2603, a China-based threat actor, is targeting SharePoint customers in an ongoing ransomware campaign.",
        "published": "2025-07-24"
    },
    {
        "title": "Fixed Ivanti Bugs Still Haunt Japan Orgs 6 Months Later",
        "link": "https://www.darkreading.com/endpoint-security/fixed-ivanti-bugs-japan-orgs-6-months-later",
        "summary": "Chinese threat actors have been feeding off the same Ivanti RCE vulnerabilities we've known about since January, partly thanks to complications in patching.",
        "published": "2025-07-24"
    },
    {
        "title": "Banking Trojan Coyote Abuses Windows UI Automation",
        "link": "https://www.darkreading.com/cyber-risk/banking-trojan-coyote-windows-ui-automation",
        "summary": "It's the first known instance of malware that abuses the UIA framework and has enabled dozens of attacks against banks and crypto exchanges in Brazil.",
        "published": "2025-07-23"
    },
    {
        "title": "Dark Web Hackers Moonlight as Travel Agents",
        "link": "https://www.darkreading.com/remote-workforce/dark-web-hackers-moonlight-travel-agents",
        "summary": "Hackers are using stolen goods such as credit cards and loyalty points to book travel for sometimes unsuspecting clients, and remote workers, SMBs, travel brands, and others are at risk.",
        "published": "2025-07-23"
    },
    {
        "title": "Department of Education Site Mimicked in Phishing Scheme",
        "link": "https://www.darkreading.com/threat-intelligence/department-of-education-site-phishing-scheme",
        "summary": "An ongoing phishing campaign is using fake versions of the department's G5 grant portal, taking advantage of political turmoil associated with the DoE's 1,400 layoffs.",
        "published": "2025-07-23"
    },
    {
        "title": "US Nuclear Agency Hacked in Microsoft SharePoint Frenzy",
        "link": "https://www.darkreading.com/cyberattacks-data-breaches/us-nuclear-agency-hacked-microsoft-sharepoint",
        "summary": "Threat actors are piling on the zero-day vulnerabilities in SharePoint, including at least three Chinese nation-state cyber-espionage groups.",
        "published": "2025-07-23"
    },
    {
        "title": "Lumma Stealer Is Back &amp; Stealthier Than Ever",
        "link": "https://www.darkreading.com/endpoint-security/lumma-stealer-stealthier-than-ever",
        "summary": "The operators of the popular and prolific malware wasted no time in regrouping after an FBI takedown in May, and they're back to their old tricks.",
        "published": "2025-07-23"
    },
    {
        "title": "China Nation-State Actors Target SharePoint Bugs",
        "link": "https://www.darkreading.com/application-security/3-china-nation-state-actors-sharepoint-bugs",
        "summary": "Hackers and cybercrime groups are part of a virtual feeding frenzy, after Microsoft's recent disclosure of new vulnerabilities in on-premises editions of SharePoint Server.",
        "published": "2025-07-22"
    },
    {
        "title": "How IT and OT Security Worlds Are Converging",
        "link": "https://www.darkreading.com/ics-ot-security/ciso-conversations-convergence-of-it-and-ot-security",
        "summary": "Dark Reading's Kelly Jackson Higgins interviews Carmine Valente, deputy CISO at Con Edison, about his role at the New York-based electric utility and the state of IT and OT security. Valente highlights current threats, including ransomware and supply chain attacks, as well as the impact of AI on both defense and threats.",
        "published": "2025-07-22"
    },
    {
        "title": "Dell Breached by Extortion Group, Says Data Stolen Was 'Fake'",
        "link": "https://www.darkreading.com/cyberattacks-data-breaches/dell-breached-data-stolen-fake",
        "summary": "The World Leaks group accessed and released data from the company's Customer Solution Center, which is separated from customer and partner systems and stores primarily \"synthetic\" datasets used for demos and testing, Dell said.",
        "published": "2025-07-22"
    },
    {
        "title": "China-Backed APT41 Cyberattack Surfaces in Africa",
        "link": "https://www.darkreading.com/cyberattacks-data-breaches/china-backed-apt41-attack-africa",
        "summary": "Up to now, the prolific China-sponsored cyber-espionage group has been mostly absent from the region, but a sophisticated and highly targeted attack on an African IT company shows Beijing is branching out.",
        "published": "2025-07-22"
    },
    {
        "title": "Human Digital Twins Could Give Attackers a Dangerous Advantage",
        "link": "https://www.darkreading.com/threat-intelligence/human-digital-twins-attackers-dangerous-advantage",
        "summary": "While this emerging technology offers many benefits, digital twins also have several drawbacks, as these convincing impersonations can be used in social engineering attacks.",
        "published": "2025-07-21"
    },
    {
        "title": "Europol Sting Leaves Russian Cybercrime's 'NoName057(16)' Group Fractured",
        "link": "https://www.darkreading.com/threat-intelligence/europol-sting-russian-cybercrime-noname05716",
        "summary": "National authorities have issued seven arrest warrants in total relating to the cybercrime collective known as NoName057(16), which recruits followers to carry out DDoS attacks on perceived enemies of Russia.",
        "published": "2025-07-21"
    },
    {
        "title": "Microsoft Rushes Emergency Patch for Actively Exploited SharePoint 'ToolShell' Bug",
        "link": "https://www.darkreading.com/remote-workforce/microsoft-rushes-emergency-fix-exploited-sharepoint-toolshell-flaw",
        "summary": "Malicious actors already have already pounced on the zero-day vulnerability, tracked as CVE-2025-53770, to compromise US government agencies and other businesses in ongoing and widespread attacks.",
        "published": "2025-07-21"
    },
    {
        "title": "'PoisonSeed' Attacker Skates Around FIDO Keys",
        "link": "https://www.darkreading.com/remote-workforce/poisonseed-attacker-fido-keys",
        "summary": "Researchers discovered a novel phishing attack that serves the victim a QR code as part of supposed multifactor authentication (MFA), in order to get around FIDO-based protections.",
        "published": "2025-07-18"
    },
    {
        "title": "Chinese APTs Attack Taiwan's Semiconductor Industry",
        "link": "https://www.darkreading.com/cyberattacks-data-breaches/4-chinese-apts-taiwan-semiconductor-industry",
        "summary": "Chinese threat actors have turned to cyberattacks as a way to undermine and destabilize Taiwan's most important industrial sector.",
        "published": "2025-07-18"
    },
    {
        "title": "A Broad, Leafy Avenue to Compromise",
        "link": "https://www.darkreading.com/endpoint-security/printer-security-gaps-compromise",
        "summary": "Security teams aren't patching firmware promptly, no one's vetting the endpoints before purchase, and visibility into potential dangers is limited — despite more and more cyberattackers targeting printers as a matter of course.",
        "published": "2025-07-17"
    },
    {
        "title": "Why Cybersecurity Still Matters for America's Schools",
        "link": "https://www.darkreading.com/vulnerabilities-threats/why-cybersecurity-still-matters-americas-schools",
        "summary": "Cyberattacks on educational institutions are growing. But with budget constraints and funding shortfalls, leadership teams are questioning whether — and how — they can keep their institutions safe.",
        "published": "2025-07-17"
    },
    {
        "title": "China-Backed Salt Typhoon Hacks US National Guard for Nearly a Year",
        "link": "https://www.darkreading.com/cyberattacks-data-breaches/salt-typhoon-hacks-us-national-guard",
        "summary": "Between March and December of last year, infamous Chinese state-sponsored APT Salt Typhoon gained access to sensitive US National Guard data.",
        "published": "2025-07-17"
    },
    {
        "title": "Elite 'Matanbuchus 3.0' Loader Spruces Up Ransomware Infections",
        "link": "https://www.darkreading.com/threat-intelligence/matanbuchus-loader-ransomware-infections",
        "summary": "An upgraded cybercrime tool is designed to make targeted ransomware attacks as easy and effective as possible, with features like EDR-spotting and DNS-based C2 communication.",
        "published": "2025-07-16"
    },
    {
        "title": "Women Who 'Hacked the Status Quo' Aim to Inspire Cybersecurity Careers",
        "link": "https://www.darkreading.com/cybersecurity-operations/women-hacked-status-quo-cybersecurity-careers",
        "summary": "A group of female cybersecurity pioneers will share what they've learned about navigating a field dominated by men, in order to help other women empower themselves and pursue successful cybersecurity careers.",
        "published": "2025-07-16"
    },
    {
        "title": "Fully Patched SonicWall Gear Under Likely Zero-Day Attack",
        "link": "https://www.darkreading.com/remote-workforce/fully-patched-sonicwall-gear-zero-day-attack",
        "summary": "A threat actor with likely links to the Abyss ransomware group is leveraging an apparent zero-day vulnerability to deploy the \"Overstep\" backdoor on fully up-to-date appliances.",
        "published": "2025-07-16"
    },
    {
        "title": "Demonstrating Cybersecurity's Return",
        "link": "https://www.darkreading.com/vulnerabilities-threats/securing-budget-cybersecurity-return",
        "summary": "By tying security investments to measurable outcomes — like reduced breach likelihood and financial impact — CISOs can align internal stakeholders and justify spending based on real-world risk.",
        "published": "2025-07-16"
    },
    {
        "title": "AsyncRAT Spawns Concerning Labyrinth of Forks",
        "link": "https://www.darkreading.com/remote-workforce/async-rat-labyrinth-forks",
        "summary": "Since surfacing on GitHub in 2019, AsyncRAT has become a poster child for how open source malware can democratize cybercrime, with a mazelike footprint of variants available across the spectrum of functionality.",
        "published": "2025-07-15"
    },
    {
        "title": "Attackers Abuse AWS Cloud to Target Southeast Asian Governments",
        "link": "https://www.darkreading.com/cloud-security/attackers-abuse-aws-southeast-asian-governments-novel-rat",
        "summary": "The intelligence-gathering cyber campaign introduces the novel HazyBeacon backdoor and uses legitimate cloud communication channels for command-and-control (C2) and exfiltration to hide its malicious activities.",
        "published": "2025-07-15"
    },
    {
        "title": "Critical Mitel Flaw Lets Hackers Bypass Login, Gain Full Access to MiVoice MX-ONE Systems",
        "link": "https://thehackernews.com/2025/07/critical-mitel-flaw-lets-hackers-bypass.html",
        "summary": "Mitel has released security updates to address a critical security flaw in MiVoice MX-ONE that could allow an attacker to bypass authentication protections.\n\"An authentication bypass vulnerability has been identified in the Provisioning Manager component of Mitel MiVoice MX-ONE, which, if successfully exploited, could allow an unauthenticated attacker to conduct an authentication bypass attack",
        "published": "2025-07-24"
    },
    {
        "title": "Fire Ant Exploits VMware Flaws to Compromise ESXi Hosts and vCenter Environments",
        "link": "https://thehackernews.com/2025/07/fire-ant-exploits-vmware-flaw-to.html",
        "summary": "Virtualization and networking infrastructure have been targeted by a threat actor codenamed Fire Ant as part of a prolonged cyber espionage campaign.\nThe activity, observed this year, is primarily designed Now to infiltrate organizations' VMware ESXi and vCenter environments as well as network appliances, Sygnia said in a new report published today.\n\"The threat actor leveraged combinations of",
        "published": "2025-07-24"
    },
    {
        "title": "CastleLoader Malware Infects 469 Devices Using Fake GitHub Repos and ClickFix Phishing",
        "link": "https://thehackernews.com/2025/07/castleloader-malware-infects-469.html",
        "summary": "Cybersecurity researchers have shed light on a new versatile malware loader called CastleLoader that has been put to use in campaigns distributing various information stealers and remote access trojans (RATs).\nThe activity employs Cloudflare-themed ClickFix phishing attacks and fake GitHub repositories opened under the names of legitimate applications, Swiss cybersecurity company PRODAFT said in",
        "published": "2025-07-24"
    },
    {
        "title": "Sophos and SonicWall Patch Critical RCE Flaws Affecting Firewalls and SMA 100 Devices",
        "link": "https://thehackernews.com/2025/07/sophos-and-sonicwall-patch-critical-rce.html",
        "summary": "Sophos and SonicWall have alerted users of critical security flaws in Sophos Firewall and Secure Mobile Access (SMA) 100 Series appliances that could be exploited to achieve remote code execution. \nThe two vulnerabilities impacting Sophos Firewall are listed below -\n\nCVE-2025-6704 (CVSS score: 9.8) - An arbitrary file writing vulnerability in the Secure PDF eXchange (SPX) feature can lead",
        "published": "2025-07-24"
    },
    {
        "title": "China-Based APTs Deploy Fake Dalai Lama Apps to Spy on Tibetan Community",
        "link": "https://thehackernews.com/2025/07/china-based-apts-deploy-fake-dalai-lama.html",
        "summary": "The Tibetan community has been targeted by a China-nexus cyber espionage group as part of two campaigns conducted last month ahead of the Dalai Lama's 90th birthday on July 6, 2025.\nThe multi-stage attacks have been codenamed Operation GhostChat and Operation PhantomPrayers by Zscaler ThreatLabz.\n\"The attackers compromised a legitimate website, redirecting users via a malicious link and",
        "published": "2025-07-24"
    },
    {
        "title": "Storm-2603 Exploits SharePoint Flaws to Deploy Warlock Ransomware on Unpatched Systems",
        "link": "https://thehackernews.com/2025/07/storm-2603-exploits-sharepoint-flaws-to.html",
        "summary": "Microsoft has revealed that one of the threat actors behind the active exploitation of SharePoint flaws is deploying Warlock ransomware on targeted systems.\nThe tech giant, in an update shared Wednesday, said the findings are based on an \"expanded analysis and threat intelligence from our continued monitoring of exploitation activity by Storm-2603.\"\nThe threat actor attributed to the financially",
        "published": "2025-07-24"
    },
    {
        "title": "Europol Arrests XSS Forum Admin in Kyiv After 12-Year Run Operating Cybercrime Marketplace",
        "link": "https://thehackernews.com/2025/07/europol-arrests-xss-forum-admin-in-kyiv.html",
        "summary": "Europol on Monday announced the arrest of the suspected administrator of XSS.is (formerly DaMaGeLaB), a notorious Russian-speaking cybercrime platform.\nThe arrest, which took place in Kyiv, Ukraine, on July 222, 2025, was led by the French Police and Paris Prosecutor, in collaboration with Ukrainian authorities and Europol. The action is the result of an investigation that was launched by the",
        "published": "2025-07-24"
    },
    {
        "title": "Hackers Deploy Stealth Backdoor in WordPress Mu-Plugins to Maintain Admin Access",
        "link": "https://thehackernews.com/2025/07/hackers-deploy-stealth-backdoor-in.html",
        "summary": "Cybersecurity researchers have uncovered a new stealthy backdoor concealed within the \"mu-plugins\" directory in WordPress sites to grant threat actors persistent access and allow them to perform arbitrary actions.\nMust-use plugins (aka mu-plugins) are special plugins that are automatically activated on all WordPress sites in the installation. They are located in the \"wp-content/mu-plugins\"",
        "published": "2025-07-24"
    },
    {
        "title": "Threat Actor Mimo Targets Magento and Docker to Deploy Crypto Miners and Proxyware",
        "link": "https://thehackernews.com/2025/07/threat-actor-mimo-targets-magento-and.html",
        "summary": "The threat actor behind the exploitation of vulnerable Craft Content Management System (CMS) instances has shifted its tactics to target Magento CMS and misconfigured Docker instances.\nThe activity has been attributed to a threat actor tracked as Mimo (aka Hezb), which has a long history of leveraging N-day security flaws in various web applications to deploy cryptocurrency miners.\n\"Although",
        "published": "2025-07-23"
    },
    {
        "title": "New Coyote Malware Variant Exploits Windows UI Automation to Steal Banking Credentials",
        "link": "https://thehackernews.com/2025/07/new-coyote-malware-variant-exploits.html",
        "summary": "The Windows banking trojan known as Coyote has become the first known malware strain to exploit the Windows accessibility framework called UI Automation (UIA) to harvest sensitive information.\n\"The new Coyote variant is targeting Brazilian users, and uses UIA to extract credentials linked to 75 banking institutes' web addresses and cryptocurrency exchanges,\" Akamai security researcher Tomer",
        "published": "2025-07-23"
    },
    {
        "title": "Google Launches OSS Rebuild to Expose Malicious Code in Widely Used Open-Source Packages",
        "link": "https://thehackernews.com/2025/07/google-launches-oss-rebuild-to-expose.html",
        "summary": "Google has announced the launch of a new initiative called OSS Rebuild to bolster the security of the open-source package ecosystems and prevent software supply chain attacks.\n\"As supply chain attacks continue to target widely-used dependencies, OSS Rebuild gives security teams powerful data to avoid compromise without burden on upstream maintainers,\" Matthew Suozzo, Google Open Source Security",
        "published": "2025-07-23"
    },
    {
        "title": "CISA Orders Urgent Patching After Chinese Hackers Exploit SharePoint Flaws in Live Attacks",
        "link": "https://thehackernews.com/2025/07/cisa-orders-urgent-patching-after.html",
        "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA), on July 22, 2025, added two Microsoft SharePoint flaws, CVE-2025-49704 and CVE-2025-49706, to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nTo that end, Federal Civilian Executive Branch (FCEB) agencies are required to remediate identified vulnerabilities by July 23, 2025.\n\"CISA is",
        "published": "2025-07-23"
    },
    {
        "title": "SysAid Flaws Under Active Attack Enable Remote File Access and SSRF",
        "link": "https://thehackernews.com/2025/07/cisa-warns-sysaid-flaws-under-active.html",
        "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added two security flaws impacting SysAid IT support software to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerabilities in question are listed below -\n\nCVE-2025-2775 (CVSS score: 9.3) - An improper restriction of XML external entity (XXE) reference vulnerability in the",
        "published": "2025-07-23"
    },
    {
        "title": "Microsoft Links Ongoing SharePoint Exploits to Three Chinese Hacker Groups",
        "link": "https://thehackernews.com/2025/07/microsoft-links-ongoing-sharepoint.html",
        "summary": "Microsoft has formally tied the exploitation of security flaws in internet-facing SharePoint Server instances to two Chinese hacking groups called Linen Typhoon and Violet Typhoon as early as July 7, 2025, corroborating earlier reports.\nThe tech giant said it also observed a third China-based threat actor, which it tracks as Storm-2603, weaponizing the flaws as well to obtain initial access to",
        "published": "2025-07-22"
    },
    {
        "title": "Cisco Confirms Active Exploits Targeting ISE Flaws Enabling Unauthenticated Root Access",
        "link": "https://thehackernews.com/2025/07/cisco-confirms-active-exploits.html",
        "summary": "Cisco on Monday updated its advisory of a set of recently disclosed security flaws in Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC) to acknowledge active exploitation.\n\"In July 2025, the Cisco PSIRT [Product Security Incident Response Team], became aware of attempted exploitation of some of these vulnerabilities in the wild,\" the company said in an alert.\nThe",
        "published": "2025-07-22"
    },
    {
        "title": "Credential Theft and Remote Access Surge as AllaKore, PureRAT, and Hijack Loader Proliferate",
        "link": "https://thehackernews.com/2025/07/credential-theft-and-remote-access.html",
        "summary": "Mexican organizations are still being targeted by threat actors to deliver a modified version of AllaKore RAT and SystemBC as part of a long-running campaign. \nThe activity has been attributed by Arctic Wolf Labs to a financially motivated hacking group called Greedy Sponge. It's believed to be active since early 2021, indiscriminately targeting a wide range of sectors, such as retail,",
        "published": "2025-07-22"
    },
    {
        "title": "How to Advance from SOC Manager to CISO?",
        "link": "https://thehackernews.com/2025/07/how-to-advance-from-soc-manager-to-ciso.html",
        "summary": "Making the move from managing a security operations center (SOC) to being a chief information security officer (CISO) is a significant career leap. Not only do you need a solid foundation of tech knowledge but also leadership skills and business smarts. \nThis article will guide you through the practical steps and skills you’ll need to nab an executive cybersecurity job and make the",
        "published": "2025-07-22"
    },
    {
        "title": "Hackers Exploit SharePoint Zero-Day Since July 7 to Steal Keys, Maintain Persistent Access",
        "link": "https://thehackernews.com/2025/07/hackers-exploit-sharepoint-zero-day.html",
        "summary": "The recently disclosed critical Microsoft SharePoint vulnerability has been under exploitation as early as July 7, 2025, according to findings from Check Point Research.\nThe cybersecurity company said it observed first exploitation attempts targeting an unnamed major Western government, with the activity intensifying on July 18 and 19, spanning government, telecommunications, and software",
        "published": "2025-07-22"
    },
    {
        "title": "Iran-Linked DCHSpy Android Malware Masquerades as VPN Apps to Spy on Dissidents",
        "link": "https://thehackernews.com/2025/07/iran-linked-dchspy-android-malware.html",
        "summary": "Cybersecurity researchers have unearthed new Android spyware artifacts that are likely affiliated with the Iranian Ministry of Intelligence and Security (MOIS) and have been distributed to targets by masquerading as VPN apps and Starlink, a satellite internet connection service offered by SpaceX.\nMobile security vendor Lookout said it discovered four samples of a surveillanceware tool it tracks",
        "published": "2025-07-21"
    },
    {
        "title": "China-Linked Hackers Launch Targeted Espionage Campaign on African IT Infrastructure",
        "link": "https://thehackernews.com/2025/07/china-linked-hackers-launch-targeted.html",
        "summary": "The China-linked cyber espionage group tracked as APT41 has been attributed to a new campaign targeting government IT services in the African region.\n\"The attackers used hardcoded names of internal services, IP addresses, and proxy servers embedded within their malware,\" Kaspersky researchers Denis Kulik and Daniil Pogorelov said. \"One of the C2s [command-and-control servers] was a captive",
        "published": "2025-07-21"
    },
    {
        "title": "SharePoint 0-Day, Chrome Exploit, macOS Spyware, NVIDIA Toolkit RCE and More",
        "link": "https://thehackernews.com/2025/07/weekly-recap-sharepoint-0-day-chrome.html",
        "summary": "Even in well-secured environments, attackers are getting in—not with flashy exploits, but by quietly taking advantage of weak settings, outdated encryption, and trusted tools left unprotected.\nThese attacks don’t depend on zero-days. They work by staying unnoticed—slipping through the cracks in what we monitor and what we assume is safe. What once looked suspicious now blends in, thanks to",
        "published": "2025-07-21"
    },
    {
        "title": "Assessing the Role of AI in Zero Trust",
        "link": "https://thehackernews.com/2025/07/assessing-role-of-ai-in-zero-trust.html",
        "summary": "By 2025, Zero Trust has evolved from a conceptual framework into an essential pillar of modern security. No longer merely theoretical, it’s now a requirement that organizations must adopt. A robust, defensible architecture built on Zero Trust principles does more than satisfy baseline regulatory mandates. It underpins cyber resilience, secures third-party partnerships, and ensures uninterrupted",
        "published": "2025-07-21"
    },
    {
        "title": "PoisonSeed Hackers Bypass FIDO Keys Using QR Phishing and Cross-Device Sign-In Abuse",
        "link": "https://thehackernews.com/2025/07/poisonseed-hackers-bypass-fido-keys.html",
        "summary": "Cybersecurity researchers have disclosed a novel attack technique that allows threat actors to downgrade Fast IDentity Online (FIDO) key protections by deceiving users into approving authentication requests from spoofed company login portals.FIDO keys are hardware- or software-based authenticators designed to eliminate phishing by binding logins to specific domains using public-private key",
        "published": "2025-07-21"
    },
    {
        "title": "Microsoft Releases Urgent Patch for SharePoint RCE Flaw Exploited in Ongoing Cyber Attacks",
        "link": "https://thehackernews.com/2025/07/microsoft-releases-urgent-patch-for.html",
        "summary": "Microsoft on Sunday released security patches for an actively exploited security flaw in SharePoint and also disclosed details of another vulnerability that it said has been addressed with \"more robust protections.\"\nThe tech giant acknowledged it's \"aware of active attacks targeting on-premises SharePoint Server customers by exploiting vulnerabilities partially addressed by the July Security",
        "published": "2025-07-21"
    },
    {
        "title": "Hard-Coded Credentials Found in HPE Instant On Devices Allow Admin Access",
        "link": "https://thehackernews.com/2025/07/hard-coded-credentials-found-in-hpe.html",
        "summary": "Hewlett-Packard Enterprise (HPE) has released security updates to address a critical security flaw affecting Instant On Access Points that could allow an attacker to bypass authentication and gain administrative access to susceptible systems.\nThe vulnerability, tracked as CVE-2025-37103, carries a CVSS score of 9.8 out of a maximum of 10.0.\n\"Hard-coded login credentials were found in HPE",
        "published": "2025-07-21"
    },
    {
        "title": ",500 Websites Hijacked to Secretly Mine Crypto Using Stealth JavaScript and WebSocket Tactics",
        "link": "https://thehackernews.com/2025/07/3500-websites-hijacked-to-secretly-mine.html",
        "summary": "A new attack campaign has compromised more than 3,500 websites worldwide with JavaScript cryptocurrency miners, marking the return of browser-based cryptojacking attacks once popularized by the likes of CoinHive. \nAlthough the service has since shuttered after browser makers took steps to ban miner-related apps and add-ons, researchers from the c/side said they found evidence of a stealthy",
        "published": "2025-07-21"
    },
    {
        "title": "EncryptHub Targets Web3 Developers Using Fake AI Platforms to Deploy Fickle Stealer Malware",
        "link": "https://thehackernews.com/2025/07/encrypthub-targets-web3-developers.html",
        "summary": "The financially motivated threat actor known as EncryptHub (aka LARVA-208 and Water Gamayun) has been attributed to a new campaign that's targeting Web3 developers to infect them with information stealer malware.\n\"LARVA-208 has evolved its tactics, using fake AI platforms (e.g., Norlax AI, mimicking Teampilot) to lure victims with job offers or portfolio review requests,\" Swiss cybersecurity",
        "published": "2025-07-20"
    },
    {
        "title": "Critical Unpatched SharePoint Zero-Day Actively Exploited, Breaches 75+ Company Servers",
        "link": "https://thehackernews.com/2025/07/critical-microsoft-sharepoint-flaw.html",
        "summary": "A critical security vulnerability in Microsoft SharePoint Server has been weaponized as part of an \"active, large-scale\" exploitation campaign.\nThe zero-day flaw, tracked as CVE-2025-53770 (CVSS score: 9.8), has been described as a variant of CVE-2025-49704 (CVSS score: 8.8), a code injection and remote code execution bug in Microsoft SharePoint Server that was addressed by the tech giant as",
        "published": "2025-07-20"
    },
    {
        "title": "Malware Injected into 7 npm Packages After Maintainer Tokens Stolen in Phishing Attack",
        "link": "https://thehackernews.com/2025/07/malware-injected-into-6-npm-packages.html",
        "summary": "Cybersecurity researchers have alerted to a supply chain attack that has targeted popular npm packages via a phishing campaign designed to steal the project maintainers' npm tokens.\nThe captured tokens were then used to publish malicious versions of the packages directly to the registry without any source code commits or pull requests on their respective GitHub repositories.\nThe list of affected",
        "published": "2025-07-20"
    },
    {
        "title": "Hackers Exploit Critical CrushFTP Flaw to Gain Admin Access on Unpatched Servers",
        "link": "https://thehackernews.com/2025/07/hackers-exploit-critical-crushftp-flaw.html",
        "summary": "A newly disclosed critical security flaw in CrushFTP has come under active exploitation in the wild. Assigned the CVE identifier CVE-2025-54309, the vulnerability carries a CVSS score of 9.0.\n\"CrushFTP 10 before 10.8.5 and 11 before 11.3.4_23, when the DMZ proxy feature is not used, mishandles AS2 validation and consequently allows remote attackers to obtain admin access via HTTPS,\" according to",
        "published": "2025-07-20"
    },
    {
        "title": "China's Massistant Tool Secretly Extracts SMS, GPS Data, and Images From Confiscated Phones",
        "link": "https://thehackernews.com/2025/07/chinas-massistant-tool-secretly.html",
        "summary": "Cybersecurity researchers have shed light on a mobile forensics tool called Massistant that's used by law enforcement authorities in China to gather information from seized mobile devices.\nThe hacking tool, believed to be a successor of MFSocket, is developed by a Chinese company named SDIC Intelligence Xiamen Information Co., Ltd., which was formerly known as Meiya Pico. It specializes in the",
        "published": "2025-07-19"
    },
    {
        "title": "UNG0002 Group Hits China, Hong Kong, Pakistan Using LNK Files and RATs in Twin Campaigns",
        "link": "https://thehackernews.com/2025/07/ung0002-group-hits-china-hong-kong.html",
        "summary": "Multiple sectors in China, Hong Kong, and Pakistan have become the target of a threat activity cluster tracked as UNG0002 (aka Unknown Group 0002) as part of a broader cyber espionage campaign.\n\"This threat entity demonstrates a strong preference for using shortcut files (LNK), VBScript, and post-exploitation tools such as Cobalt Strike and Metasploit, while consistently deploying CV-themed",
        "published": "2025-07-18"
    },
    {
        "title": "Ivanti Flaws Exploited to Drop MDifyLoader and Launch In-Memory Cobalt Strike Attacks",
        "link": "https://thehackernews.com/2025/07/ivanti-zero-days-exploited-to-drop.html",
        "summary": "Cybersecurity researchers have disclosed details of a new malware called MDifyLoader that has been observed in conjunction with cyber attacks exploiting security flaws in Ivanti Connect Secure (ICS) appliances.\nAccording to a report published by JPCERT/CC today, the threat actors behind the exploitation of CVE-2025-0282 and CVE-2025-22457 in intrusions observed between December 2024 and July",
        "published": "2025-07-18"
    },
    {
        "title": "CERT-UA Discovers LAMEHUG Malware Linked to APT28, Using LLM for Phishing Campaign",
        "link": "https://thehackernews.com/2025/07/cert-ua-discovers-lamehug-malware.html",
        "summary": "The Computer Emergency Response Team of Ukraine (CERT-UA) has disclosed details of a phishing campaign that's designed to deliver a malware codenamed LAMEHUG.\n\"An obvious feature of LAMEHUG is the use of LLM (large language model), used to generate commands based on their textual representation (description),\" CERT-UA said in a Thursday advisory.\nThe activity has been attributed with medium",
        "published": "2025-07-18"
    },
    {
        "title": "Critical NVIDIA Container Toolkit Flaw Allows Privilege Escalation on AI Cloud Services",
        "link": "https://thehackernews.com/2025/07/critical-nvidia-container-toolkit-flaw.html",
        "summary": "Cybersecurity researchers have disclosed a critical container escape vulnerability in the NVIDIA Container Toolkit that could pose a severe threat to managed AI cloud services.\nThe vulnerability, tracked as CVE-2025-23266, carries a CVSS score of 9.0 out of 10.0. It has been codenamed NVIDIAScape by Google-owned cloud security company Wiz.\n\"NVIDIA Container Toolkit for all platforms contains a",
        "published": "2025-07-18"
    },
    {
        "title": "Google Sues 25 Chinese Entities Over BADBOX 2.0 Botnet Affecting 10M Android Devices",
        "link": "https://thehackernews.com/2025/07/google-sues-25-chinese-entities-over.html",
        "summary": "Google on Thursday revealed it's pursuing legal action in New York federal court against 25 unnamed individuals or entities in China for allegedly operating BADBOX 2.0 botnet and residential proxy infrastructure.\n\"The BADBOX 2.0 botnet compromised over 10 million uncertified devices running Android's open-source software (Android Open Source Project), which lacks Google's security protections,\"",
        "published": "2025-07-18"
    },
    {
        "title": "Why IT Leaders Must Rethink Backup in the Age of Ransomware",
        "link": "https://thehackernews.com/2025/07/how-cyber-resilience-helps-it-defend-against-ransomwa.html",
        "summary": "With IT outages and disruptions escalating, IT teams are shifting their focus beyond simply backing up data to maintaining operations during an incident. One of the key drivers behind this shift is the growing threat of ransomware, which continues to evolve in both frequency and complexity. Ransomware-as-a-Service (RaaS) platforms have made it possible for even inexperienced threat actors with",
        "published": "2025-07-18"
    },
    {
        "title": "Hackers Use GitHub Repositories to Host Amadey Malware and Data Stealers, Bypassing Filters",
        "link": "https://thehackernews.com/2025/07/hackers-use-github-repositories-to-host.html",
        "summary": "Threat actors are leveraging public GitHub repositories to host malicious payloads and distribute them via Amadey as part of a campaign observed in April 2025.\n\"The MaaS [malware-as-a-service] operators used fake GitHub accounts to host payloads, tools, and Amadey plug-ins, likely as an attempt to bypass web filtering and for ease of use,\" Cisco Talos researchers Chris Neal and Craig Jackson",
        "published": "2025-07-17"
    },
    {
        "title": "Hackers Exploit Apache HTTP Server Flaw to Deploy Linuxsys Cryptocurrency Miner",
        "link": "https://thehackernews.com/2025/07/hackers-exploit-apache-http-server-flaw.html",
        "summary": "Cybersecurity researchers have discovered a new campaign that exploits a known security flaw impacting Apache HTTP Server to deliver a cryptocurrency miner called Linuxsys.\nThe vulnerability in question is CVE-2021-41773 (CVSS score: 7.5), a high-severity path traversal vulnerability in Apache HTTP Server version 2.4.49 that could result in remote code execution.\n\"The attacker leverages",
        "published": "2025-07-17"
    },
    {
        "title": "Europol Disrupts NoName057(16) Hacktivist Group Linked to DDoS Attacks Against Ukraine",
        "link": "https://thehackernews.com/2025/07/europol-disrupts-noname05716-hacktivist.html",
        "summary": "An international operation coordinated by Europol has disrupted the infrastructure of a pro-Russian hacktivist group known as NoName057(16) that has been linked to a string of distributed denial-of-service (DDoS) attacks against Ukraine and its allies.\nThe actions have led to the dismantling of a major part of the group's central server infrastructure and more than 100 systems across the world.",
        "published": "2025-07-17"
    },
    {
        "title": "What Security Leaders Need to Know in 2025",
        "link": "https://thehackernews.com/2025/07/ctem-vs-asm-vs-vulnerability-management.html",
        "summary": "The modern-day threat landscape requires enterprise security teams to think and act beyond traditional cybersecurity measures that are purely passive and reactive, and in most cases, ineffective against emerging threats and sophisticated threat actors. Prioritizing cybersecurity means implementing more proactive, adaptive, and actionable measures that can work together to effectively address the",
        "published": "2025-07-17"
    },
    {
        "title": "Chinese Hackers Target Taiwan's Semiconductor Sector with Cobalt Strike, Custom Backdoors",
        "link": "https://thehackernews.com/2025/07/chinese-hackers-target-taiwans.html",
        "summary": "The Taiwanese semiconductor industry has become the target of spear-phishing campaigns undertaken by three previously undocumented Chinese state-sponsored threat actors.\n\"Targets of these campaigns ranged from organizations involved in the manufacturing, design, and testing of semiconductors and integrated circuits, wider equipment and services supply chain entities within this sector, as well",
        "published": "2025-07-17"
    },
    {
        "title": "Cisco Warns of Critical ISE Flaw Allowing Unauthenticated Attackers to Execute Root Code",
        "link": "https://thehackernews.com/2025/07/cisco-warns-of-critical-ise-flaw.html",
        "summary": "Cisco has disclosed a new maximum-severity security vulnerability impacting Identity Services Engine (ISE) and Cisco ISE Passive Identity Connector (ISE-PIC) that could permit an attacker to execute arbitrary code on the underlying operating system with elevated privileges.\nTracked as CVE-2025-20337, the shortcoming carries a CVSS score of 10.0 and is similar to CVE-2025-20281, which was patched",
        "published": "2025-07-17"
    },
    {
        "title": "Hackers Leverage Microsoft Teams to Spread Matanbuchus 3.0 Malware to Targeted Firms",
        "link": "https://thehackernews.com/2025/07/hackers-leverage-microsoft-teams-to.html",
        "summary": "Cybersecurity researchers have flagged a new variant of a known malware loader called Matanbuchus that packs in significant features to enhance its stealth and evade detection.\nMatanbuchus is the name given to a malware-as-a-service (MaaS) offering that can act as a conduit for next-stage payloads, including Cobalt Strike beacons and ransomware.\nFirst advertised in February 2021 on",
        "published": "2025-07-16"
    },
    {
        "title": "UNC6148 Backdoors Fully-Patched SonicWall SMA 100 Series Devices with OVERSTEP Rootkit",
        "link": "https://thehackernews.com/2025/07/unc6148-backdoors-fully-patched.html",
        "summary": "A threat activity cluster has been observed targeting fully-patched end-of-life SonicWall Secure Mobile Access (SMA) 100 series appliances as part of a campaign designed to drop a backdoor called OVERSTEP.\nThe malicious activity, dating back to at least October 2024, has been attributed by the Google Threat Intelligence Group (GTIG) to a hacking crew it tracks as UNC6148. The number of known",
        "published": "2025-07-16"
    },
    {
        "title": "Critical Golden dMSA Attack in Windows Server 2025 Enables Cross-Domain Attacks and Persistent Access",
        "link": "https://thehackernews.com/2025/07/critical-golden-dmsa-attack-in-windows.html",
        "summary": "Cybersecurity researchers have disclosed what they say is a \"critical design flaw\" in delegated Managed Service Accounts (dMSAs) introduced in Windows Server 2025.\n\"The flaw can result in high-impact attacks, enabling cross-domain lateral movement and persistent access to all managed service accounts and their resources across Active Directory indefinitely,\" Semperis said in a report shared with",
        "published": "2025-07-16"
    },
    {
        "title": "Clorox Sues Cognizant After Help Desk Allegedly Gave Away Passwords to Hackers”",
        "link": "https://securityboulevard.com/2025/07/bleach-wasnt-strong-enough-clorox-sues-cognizant-after-help-desk-allegedly-gave-away-passwords-to-hackers/?utm_source=rss&utm_medium=rss&utm_campaign=bleach-wasnt-strong-enough-clorox-sues-cognizant-after-help-desk-allegedly-gave-away-passwords-to-hackers",
        "summary": "\nClorox is suing IT giant Cognizant, claiming their help desk handed over employee passwords to hackers — no phishing, no malware… just gave them away.\nThe post “Bleach Wasn’t Strong Enough: Clorox Sues Cognizant After Help Desk Allegedly Gave Away Passwords to Hackers” appeared first on Security Boulevard.",
        "published": "2025-07-25"
    },
    {
        "title": "xonPlus Launches Real-Time Breach Alerting Platform for Enterprise Credential Exposure",
        "link": "https://securityboulevard.com/2025/07/xonplus-launches-real-time-breach-alerting-platform-for-enterprise-credential-exposure/?utm_source=rss&utm_medium=rss&utm_campaign=xonplus-launches-real-time-breach-alerting-platform-for-enterprise-credential-exposure",
        "summary": "\nChennai, India, 25th July 2025, CyberNewsWire\nThe post xonPlus Launches Real-Time Breach Alerting Platform for Enterprise Credential Exposure appeared first on Security Boulevard.",
        "published": "2025-07-25"
    },
    {
        "title": "Cognizant Agents Gave Hackers Passwords, Clorox Says in Lawsuit",
        "link": "https://securityboulevard.com/2025/07/cognizant-agents-gave-hackers-gave-passwords-clorox-says-in-lawsuit/?utm_source=rss&utm_medium=rss&utm_campaign=cognizant-agents-gave-hackers-gave-passwords-clorox-says-in-lawsuit",
        "summary": "\nClorox is suing Cognizant for $380 million, saying the IT services provider's service desk put in place to protect the multinational company from cyber risks in 2023 gave hackers password resets and other credentials when asked without verifying the identities of people making the requests.\nThe post Cognizant Agents Gave Hackers Passwords, Clorox Says in Lawsuit appeared first on Security Boulevard.",
        "published": "2025-07-24"
    },
    {
        "title": "The “S” in Vibe Coding Stands for Security",
        "link": "https://securityboulevard.com/2025/07/the-s-in-vibe-coding-stands-for-security/?utm_source=rss&utm_medium=rss&utm_campaign=the-s-in-vibe-coding-stands-for-security",
        "summary": "\nVibe coding is here. And it’s not just a fad — it’s reshaping how we build, deploy and even conceive of software. But unless we hit the brakes and bake in security now, we’re setting ourselves up for another generation of vulnerabilities, exploits and blame games.\nThe post The “S” in Vibe Coding Stands for Security appeared first on Security Boulevard.",
        "published": "2025-07-24"
    },
    {
        "title": "BforeAI Identifies Phishing Campaign Using Same Infrastructure Across Multiple Domains",
        "link": "https://securityboulevard.com/2025/07/bforeai-identifies-phishing-campaign-using-same-infrastructure-across-multiple-domains/?utm_source=rss&utm_medium=rss&utm_campaign=bforeai-identifies-phishing-campaign-using-same-infrastructure-across-multiple-domains",
        "summary": "\nBforeAI today disclosed the discovery of a phishing campaign that is leveraging the same core infrastructure to spoof multiple domains.\nThe post BforeAI Identifies Phishing Campaign Using Same Infrastructure Across Multiple Domains appeared first on Security Boulevard.",
        "published": "2025-07-23"
    },
    {
        "title": "Is Ransomware Dying? Don’t Break Out the Champagne Just Yet",
        "link": "https://securityboulevard.com/2025/07/is-ransomware-dying-dont-break-out-the-champagne-just-yet/?utm_source=rss&utm_medium=rss&utm_campaign=is-ransomware-dying-dont-break-out-the-champagne-just-yet",
        "summary": "\nWe’re seeing fewer attacks, but that doesn’t mean we’re safer. The latest data from NCC Group shows traditional ransomware is down — but threat actors are regrouping, rebranding, and rearming with AI and advanced social engineering.\nThe post Is Ransomware Dying? Don’t Break Out the Champagne Just Yet appeared first on Security Boulevard.",
        "published": "2025-07-23"
    },
    {
        "title": "Akamai Identifies Coyote Malware Variant Capable of Compromising Microsoft UIA Framework",
        "link": "https://securityboulevard.com/2025/07/akamai-identifis-coyote-malware-variant-capable-of-compromising-microsoft-uia-framework/?utm_source=rss&utm_medium=rss&utm_campaign=akamai-identifis-coyote-malware-variant-capable-of-compromising-microsoft-uia-framework",
        "summary": "\nAkamai researchers today disclosed they have discovered a variant of Coyote malware that extracts specific banking and cryptocurrency exchanges by compromising the UI Automation (UIA) framework developed by Microsoft.\nThe post Akamai Identifies Coyote Malware Variant Capable of Compromising Microsoft UIA Framework appeared first on Security Boulevard.",
        "published": "2025-07-22"
    },
    {
        "title": "Threat Brief (Updated July 24)",
        "link": "https://unit42.paloaltonetworks.com/microsoft-sharepoint-cve-2025-49704-cve-2025-49706-cve-2025-53770/",
        "summary": " Unit 42 has observed active exploitation of recent Microsoft SharePoint vulnerabilities. Here’s how you can protect your organization. \nThe post Active Exploitation of Microsoft SharePoint Vulnerabilities: Threat Brief (Updated July 24) appeared first on Unit 42.",
        "published": "2025-07-22"
    },
    {
        "title": "Attackers Targeting Governments in Southeast Asia Implement Novel Covert C2 Communication",
        "link": "https://unit42.paloaltonetworks.com/windows-backdoor-for-novel-c2-communication/",
        "summary": "CL-STA-1020 targets Southeast Asian governments using a novel Microsoft backdoor we call HazyBeacon. It misuses AWS Lambda URLs for C2.\nThe post Behind the Clouds: Attackers Targeting Governments in Southeast Asia Implement Novel Covert C2 Communication appeared first on Unit 42.",
        "published": "2025-07-14"
    },
    {
        "title": "A Deep Dive Into Advanced Malware Techniques",
        "link": "https://unit42.paloaltonetworks.com/slow-tempest-malware-obfuscation/",
        "summary": "SLOW#TEMPEST malware uses dynamic jumps and obfuscated calls to evade detection. Unit 42 details these techniques and how to defeat them with emulation.\nThe post Evolving Tactics of SLOW#TEMPEST: A Deep Dive Into Advanced Malware Techniques appeared first on Unit 42.",
        "published": "2025-07-11"
    },
    {
        "title": "Preventing the ClickFix Attack Vector",
        "link": "https://unit42.paloaltonetworks.com/preventing-clickfix-attack-vector/",
        "summary": "ClickFix campaigns are on the rise. We highlight three that distributed NetSupport RAT, Latrodectus, and Lumma Stealer malware.\nThe post Fix the Click: Preventing the ClickFix Attack Vector appeared first on Unit 42.",
        "published": "2025-07-10"
    },
    {
        "title": "Initial Access Broker In-Memory IIS Modules Revealed",
        "link": "https://unit42.paloaltonetworks.com/initial-access-broker-exploits-leaked-machine-keys/",
        "summary": "An IAB campaign exploited leaked ASP.NET Machine Keys. We dissect the attacker's infrastructure, campaign and offer takeaways for blue teams.\nThe post GoldMelody’s Hidden Chords: Initial Access Broker In-Memory IIS Modules Revealed appeared first on Unit 42.",
        "published": "2025-07-08"
    },
    {
        "title": "Tomcat’s Partial PUT and Camel’s Header Hijack",
        "link": "https://unit42.paloaltonetworks.com/apache-cve-2025-24813-cve-2025-27636-cve-2025-29891/",
        "summary": "We analyze CVE-2025-24813 (Tomcat Partial PUT RCE), CVE-2025-27636 and CVE-2025-29891 (Camel Header Hijack RCE). \nThe post Apache Under the Lens: Tomcat’s Partial PUT and Camel’s Header Hijack appeared first on Unit 42.",
        "published": "2025-07-03"
    },
    {
        "title": "Windows Shortcut (LNK) Malware Strategies",
        "link": "https://unit42.paloaltonetworks.com/lnk-malware/",
        "summary": "Our telemetry shows a surge in Windows shortcut (LNK) malware use. We explain how attackers exploit LNK files for malware delivery.\nThe post Windows Shortcut (LNK) Malware Strategies appeared first on Unit 42.",
        "published": "2025-07-02"
    },
    {
        "title": "Escalation of Cyber Risk Related to Iran (Updated June 30)",
        "link": "https://unit42.paloaltonetworks.com/iranian-cyberattacks-2025/",
        "summary": "Unit 42 details recent Iranian cyberattack activity, sharing direct observations. Tactical and strategic recommendations are provided for defenders.\nThe post Threat Brief: Escalation of Cyber Risk Related to Iran (Updated June 30) appeared first on Unit 42.",
        "published": "2025-06-25"
    },
    {
        "title": "a story of five vulnerabilities in Microsoft SharePoint",
        "link": "https://securelist.com/toolshell-explained/117045/",
        "summary": "Explaining the ToolShell vulnerabilities in SharePoint: how the POST request exploit works, why initial patches can be easily bypassed, and how to stay protected.",
        "published": "2025-07-25"
    },
    {
        "title": "Rumble in the jungle or APT41’s new target in Africa",
        "link": "https://securelist.com/apt41-in-africa/116986/",
        "summary": "Kaspersky experts analyze an incident that saw APT41 launch a targeted attack on government IT services in Africa.",
        "published": "2025-07-21"
    },
    {
        "title": "malware compromising Exchange servers of high-value organizations in Asia",
        "link": "https://securelist.com/ghostcontainer/116953/",
        "summary": "In an incident response case in Asia, Kaspersky researchers discovered a new backdoor for Microsoft Exchange servers, based on open-source tools and dubbed \"GhostContainer\".",
        "published": "2025-07-17"
    },
    {
        "title": "Code highlighting with Cursor AI for $500,000",
        "link": "https://securelist.com/open-source-package-for-cursor-ai-turned-into-a-crypto-heist/116908/",
        "summary": "Kaspersky GReAT experts uncover malicious extensions for Cursor AI that download the Quasar backdoor and a crypto stealer.",
        "published": "2025-07-10"
    },
    {
        "title": "Batavia spyware steals data from Russian organizations",
        "link": "https://securelist.com/batavia-spyware-steals-data-from-russian-organizations/116866/",
        "summary": "Kaspersky experts have discovered a new spyware called Batavia, which steals data from corporate devices.",
        "published": "2025-07-07"
    },
    {
        "title": "Google Sues the Badbox Botnet Operators",
        "link": "https://www.schneier.com/blog/archives/2025/07/google-sues-the-badbox-botnet-operators.html",
        "summary": "It will be interesting to watch what will come of this private lawsuit:\nGoogle on Thursday announced filing a lawsuit against the operators of the Badbox 2.0 botnet, which has ensnared more than 10 million devices running Android open source software.\nThese devices lack Google’s security protections, and the perpetrators pre-installed the Badbox 2.0 malware on them, to create a backdoor and abuse them for large-scale fraud and other illicit schemes.\nThis reminds me of Meta’s lawauit against Pegasus over its hack-for-hire software (which I wrote about ...",
        "published": "2025-07-23"
    },
    {
        "title": "“Encryption Backdoors and the Fourth Amendment”",
        "link": "https://www.schneier.com/blog/archives/2025/07/encryption-backdoors-and-the-fourth-amendment.html",
        "summary": "Law journal article that looks at the Dual_EC_PRNG backdoor from a US constitutional perspective:\nAbstract: The National Security Agency (NSA) reportedly paid and pressured technology companies to trick their customers into using vulnerable encryption products. This Article examines whether any of three theories removed the Fourth Amendment’s requirement that this be reasonable. The first is that a challenge to the encryption backdoor might fail for want of a search or seizure. The Article rejects this both because the Amendment reaches some vulnerabilities apart from the searches and seizures they enable and because the creation of this vulnerability was itself a search or seizure. The second is that the role of the technology companies might have brought this backdoor within the private-search doctrine. The Article criticizes the doctrine­ particularly its origins in Burdeau v. McDowell­and argues that if it ever should apply, it should not here. The last is that the customers might have waived their Fourth Amendment rights under the third-party doctrine. The Article rejects this both because the customers were not on notice of the backdoor and because historical understandings of the Amendment would not have tolerated it. The Article concludes that none of these theories removed the Amendment’s reasonableness requirement...",
        "published": "2025-07-22"
    },
    {
        "title": "Another Supply Chain Vulnerability",
        "link": "https://www.schneier.com/blog/archives/2025/07/another-supply-chain-vulnerability.html",
        "summary": "ProPublica is reporting:\nMicrosoft is using engineers in China to help maintain the Defense Department’s computer systems—with minimal supervision by U.S. personnel—leaving some of the nation’s most sensitive data vulnerable to hacking from its leading cyber adversary, a ProPublica investigation has found.\nThe arrangement, which was critical to Microsoft winning the federal government’s cloud computing business a decade ago, relies on U.S. citizens with security clearances to oversee the work and serve as a barrier against espionage and sabotage...",
        "published": "2025-07-21"
    },
    {
        "title": "The Giant Squid Nebula",
        "link": "https://www.schneier.com/blog/archives/2025/07/friday-squid-blogging-the-giant-squid-nebula.html",
        "summary": "Beautiful photo.\nDifficult to capture, this mysterious, squid-shaped interstellar cloud spans nearly three full moons in planet Earth’s sky. Discovered in 2011 by French astro-imager Nicolas Outters, the Squid Nebula’s bipolar shape is distinguished here by the telltale blue emission from doubly ionized oxygen atoms. Though apparently surrounded by the reddish hydrogen emission region Sh2-129, the true distance and nature of the Squid Nebula have been difficult to determine. Still, one investigation suggests Ou4 really does lie within Sh2-129 some 2,300 light-years away. Consistent with that scenario, the cosmic squid would represent a spectacular outflow of material driven by a ...",
        "published": "2025-07-18"
    },
    {
        "title": "New Mobile Phone Forensics Tool",
        "link": "https://www.schneier.com/blog/archives/2025/07/new-mobile-phone-forensics-tool.html",
        "summary": "The Chinese have a new tool called Massistant.\n\n\nMassistant is the presumed successor to Chinese forensics tool, “MFSocket”, reported in 2019 and attributed to publicly traded cybersecurity company, Meiya Pico.\nThe forensics tool works in tandem with a corresponding desktop software.\nMassistant gains access to device GPS location data, SMS messages, images, audio, contacts and phone services.\nMeiya Pico maintains partnerships with domestic and international law enforcement partners, both as a surveillance hardware and software provider, as well as through training programs for law enforcement personnel...",
        "published": "2025-07-18"
    },
    {
        "title": "Security Vulnerabilities in ICEBlock",
        "link": "https://www.schneier.com/blog/archives/2025/07/security-vulnerabilities-in-iceblock.html",
        "summary": "The ICEBlock tool has vulnerabilities:\nThe developer of ICEBlock, an iOS app for anonymously reporting sightings of US Immigration and Customs Enforcement (ICE) officials, promises that it “ensures user privacy by storing no personal data.” But that claim has come under scrutiny. ICEBlock creator Joshua Aaron has been accused of making false promises regarding user anonymity and privacy, being “misguided” about the privacy offered by iOS, and of being an Apple fanboy. The issue isn’t what ICEBlock stores. It’s about what it could accidentally reveal through its tight integration with iOS...",
        "published": "2025-07-17"
    },
    {
        "title": "Hacking Trains",
        "link": "https://www.schneier.com/blog/archives/2025/07/hacking-trains.html",
        "summary": "Seems like an old system system that predates any care about security:\nThe flaw has to do with the protocol used in a train system known as the End-of-Train and Head-of-Train. A Flashing Rear End Device (FRED), also known as an End-of-Train (EOT) device, is attached to the back of a train and sends data via radio signals to a corresponding device in the locomotive called the Head-of-Train (HOT). Commands can also be sent to the FRED to apply the brakes at the rear of the train.\nThese devices were first installed in the 1980s as a replacement for caboose cars, and unfortunately, they lack encryption and authentication protocols. Instead, the current system uses data packets sent between the front and back of a train that include a simple BCH checksum to detect errors or interference. But now, the CISA is warning that someone using a software-defined radio could potentially send fake data packets and interfere with train operations...",
        "published": "2025-07-16"
    },
    {
        "title": "Report from the Cambridge Cybercrime Conference",
        "link": "https://www.schneier.com/blog/archives/2025/07/report-from-the-cambridge-cybercrime-conference.html",
        "summary": "The Cambridge Cybercrime Conference was held on 23 June. Summaries of the presentations are here.",
        "published": "2025-07-14"
    },
    {
        "title": "Instagram users targeted in novel phishing campaign",
        "link": "https://www.malwarebytes.com/blog/news/2025/07/watch-out-instagram-users-targeted-in-novel-phishing-campaign",
        "summary": "Phishers are using legitimate looking Instagram emails in order to scam users.",
        "published": "2025-07-25"
    },
    {
        "title": "Introducing the smarter, more sophisticated Malwarebytes Trusted Advisor, your cybersecurity personal assistant",
        "link": "https://www.malwarebytes.com/blog/product/2025/07/introducing-the-smarter-more-sophisticated-malwarebytes-trusted-advisor-your-cybersecurity-personal-assistant",
        "summary": "Malwarebytes Trusted Advisor has had an update, and it's now sharper, smarter, and more helpful than ever.",
        "published": "2025-07-24"
    },
    {
        "title": "Startup takes personal data stolen by malware and sells it on to other companies",
        "link": "https://www.malwarebytes.com/blog/news/2025/07/startup-takes-personal-data-stolen-by-malware-and-sells-it-on-to-other-companies",
        "summary": "A tech startup is using personal data stolen by infostealer malware that it has found on the dark web, and then selling access to that data.",
        "published": "2025-07-22"
    },
    {
        "title": "&#8220;Ring cameras hacked&#8221;? Amazon says no, users not so sure",
        "link": "https://www.malwarebytes.com/blog/news/2025/07/ring-cameras-hacked-amazon-says-no-users-not-so-sure",
        "summary": "Ring users on TikTok, Reddit, and X are reporting multiple unauthorized device logins all dating back to May 28.",
        "published": "2025-07-21"
    },
    {
        "title": "Meta AI chatbot bug could have allowed anyone to see private conversations",
        "link": "https://www.malwarebytes.com/blog/news/2025/07/meta-ai-chatbot-bug-could-have-allowed-anyone-to-see-private-conversations",
        "summary": "A researcher has disclosed how he found a—now fixed—vulnerability in Meta AI that could have allowed others to see private questions and answers.",
        "published": "2025-07-17"
    },
    {
        "title": "Chrome fixes 6 security vulnerabilities. Get the update now!",
        "link": "https://www.malwarebytes.com/blog/news/2025/07/chrome-fixes-6-security-vulnerabilities-get-the-update-now",
        "summary": "Google has released an update for its Chrome browser to patch six security vulnerabilities including one zero-day.",
        "published": "2025-07-17"
    },
    {
        "title": "Amazon warns 200 million Prime customers that scammers are after their login info",
        "link": "https://www.malwarebytes.com/blog/news/2025/07/amazon-warns-200-million-prime-customers-that-scammers-are-after-their-login-info",
        "summary": "Amazon has emailed 200 million customers to warn them about a rather convincing phishing campaign.",
        "published": "2025-07-16"
    },
    {
        "title": "Open Source, Rebuilt to Last",
        "link": "http://security.googleblog.com/2025/07/introducing-oss-rebuild-open-source.html",
        "summary": "Posted by Matthew Suozzo, Google Open Source Security Team (GOSST)Today we're excited to announce OSS Rebuild, a new project to strengthen trust in open source package ecosystems by reproducing upstream artifacts. As supply chain attacks continue to target widely-used dependencies, OSS Rebuild gives security teams powerful data to avoid compromise without burden on upstream maintainers.The project comprises:Automation to derive declarative build definitions for existing PyPI (Python), npm (JS/TS), and Crates.io (Rust) packages.SLSA Provenance for thousands of packages across our supported ecosystems, meeting SLSA Build Level 3 requirements with no publisher intervention.Build observability and verification tools that security teams can integrate into their existing vulnerability management workflows.Infrastructure definitions to allow organizations to easily run their own instances of OSS Rebuild to rebuild, generate, sign, and distribute provenance.ChallengesOpen source software has become the foundation of our digital world. From critical infrastructure to everyday applications, OSS components now account for 77% of modern applications. With an estimated value exceeding $12 trillion, open source software has never been more integral to the global economy.Yet this very ubiquity makes open source an attractive target: Recent high-profile supply chain attacks have demonstrated sophisticated methods for compromising widely-used packages. Each incident erodes trust in open ecosystems, creating hesitation among both contributors and consumers.The security community has responded with initiatives like Security Scorecard, pypi's Trusted Publishers, and npm's native SLSA support. However, there is no panacea: Each effort targets a certain aspect of the problem, often making tradeoffs like shifting work onto publishers and maintainers.Our AimOur aim with OSS Rebuild is to empower the security community to deeply understand and control their supply chains by making package consumption as transparent as using a source repository. Our rebuild platform unlocks this transparency by utilizing a declarative build process, build instrumentation, and network monitoring capabilities which, within the SLSA Build framework, produces fine-grained, durable, trustworthy security metadata.Building on the hosted infrastructure model that we pioneered with OSS Fuzz for memory issue detection, OSS Rebuild similarly seeks to use hosted resources to address security challenges in open source, this time aimed at securing the software supply chain.Our vision extends beyond any single ecosystem: We are committed to bringing supply chain transparency and security to all open source software development. Our initial support for the PyPI (Python), npm (JS/TS), and Crates.io (Rust) package registries—providing rebuild provenance for many of their most popular packages—is just the beginning of our journey.How OSS Rebuild WorksThrough automation and heuristics, we determine a prospective build definition for a target package and rebuild it. We semantically compare the result with the existing upstream artifact, normalizing each one to remove instabilities that cause bit-for-bit comparisons to fail (e.g. archive compression). Once we reproduce the package, we publish the build definition and outcome via SLSA Provenance. This attestation allows consumers to reliably verify a package's origin within the source history, understand and repeat its build process, and customize the build from a known-functional baseline (or maybe even use it to generate more detailed SBOMs).With OSS Rebuild's existing automation for PyPI, npm, and Crates.io, most packages obtain protection effortlessly without user or maintainer intervention. Where automation isn't currently able to fully reproduce the package, we offer manual build specification so the whole community benefits from individual contributions.And we are also excited at the potential for AI to help reproduce packages: Build and release processes are often described in natural language documentation which, while difficult to utilize with discrete logic, is increasingly useful to language models. Our initial experiments have demonstrated the approach's viability in automating exploration and testing, with limited human intervention, even in the most complex builds.Our CapabilitiesOSS Rebuild helps detect several classes of supply chain compromise:Unsubmitted Source Code - When published packages contain code not present in the public source repository, OSS Rebuild will not attest to the artifact.Real world attack: solana/webjs (2024)Build Environment Compromise - By creating standardized, minimal build environments with comprehensive monitoring, OSS Rebuild can detect suspicious build activity or avoid exposure to compromised components altogether.Real world attack: tj-actions/changed-files (2025)Stealthy Backdoors - Even sophisticated backdoors like xz often exhibit anomalous behavioral patterns during builds. OSS Rebuild's dynamic analysis capabilities can detect unusual execution paths or suspicious operations that are otherwise impractical to identify through manual review.Real world attack: xz-utils (2024)For enterprises and security professionals, OSS Rebuild can...Enhance metadata without changing registries by enriching data for upstream packages. No need to maintain custom registries or migrate to a new package ecosystem.Augment SBOMs by adding detailed build observability information to existing Software Bills of Materials, creating a more complete security picture.Accelerate vulnerability response by providing a path to vendor, patch, and re-host upstream packages using our verifiable build definitions.For publishers and maintainers of open source packages, OSS Rebuild can...Strengthen package trust by providing consumers with independent verification of the packages' build integrity, regardless of the sophistication of the original build.Retrofit historical packages' integrity with high-quality build attestations, regardless of whether build attestations were present or supported at the time of publication.Reduce CI security-sensitivity allowing publishers to focus on core development work. CI platforms tend to have complex authorization and execution models and by performing separate rebuilds, the CI environment no longer needs to be load-bearing for your packages' security.Check it out!The easiest (but not only!) way to access OSS Rebuild attestations is to use the provided Go-based command-line interface. It can be compiled and installed easily:$ go install github.com/google/oss-rebuild/cmd/oss-rebuild@latestYou can fetch OSS Rebuild's SLSA Provenance:$ oss-rebuild get cratesio syn 2.0.39..or explore the rebuilt versions of a particular package:$ oss-rebuild list pypi absl-py..or even rebuild the package for yourself:$ oss-rebuild get npm lodash 4.17.20 --output=dockerfile | \\   docker run $(docker buildx build -q -)Join Us in Helping Secure Open SourceOSS Rebuild is not just about fixing problems; it's about empowering end-users to make open source ecosystems more secure and transparent through collective action. If you're a developer, enterprise, or security researcher interested in OSS security, we invite you to follow along and get involved!Check out the code, share your ideas, and voice your feedback at github.com/google/oss-rebuild.Explore the data and contribute to improving support for your critical ecosystems and packages.Learn more about SLSA Provenance at slsa.dev",
        "published": "2025-07-21"
    },
    {
        "title": "Advancing Protection in Chrome on Android",
        "link": "http://security.googleblog.com/2025/07/advancing-protection-in-chrome-on.html",
        "summary": "Posted by David Adrian, Javier Castro & Peter Kotwicz, Chrome Security Team\n\nAndroid recently announced Advanced Protection, which extends Google’s Advanced Protection Program to a device-level security setting for Android users that need heightened security—such as journalists, elected officials, and public figures. Advanced Protection gives you the ability to activate Google’s strongest security for mobile devices, providing greater peace of mind that you’re better protected against the most sophisticated threats.\n\n\nAdvanced Protection acts as a single control point for at-risk users on Android that enables important security settings across applications, including many of your favorite Google apps, including Chrome. In this post, we’d like to do a deep dive into the Chrome features that are integrated with Advanced Protection, and how enterprises and users outside of Advanced Protection can leverage them.\n\n\nAndroid Advanced Protection integrates with Chrome on Android in three main ways:\n\n\nEnables the “Always Use Secure Connections” setting for both public and private sites, so that users are protected from attackers reading confidential data or injecting malicious content into insecure plaintext HTTP connections. Insecure HTTP represents less than 1% of page loads for Chrome on Android. \nEnables full Site Isolation on mobile devices with 4GB+ RAM, so that potentially malicious sites are never loaded in the same process as legitimate websites. Desktop Chrome clients already have full Site Isolation.\nReduces attack surface by disabling Javascript optimizations, so that Chrome has a smaller attack surface and is harder to exploit.\n\n\nLet’s take a look at all three, learn what they do, and how they can be controlled outside of Advanced Protection.\n\nAlways Use Secure Connections\n\n“Always Use Secure Connections” (also known as HTTPS-First Mode in blog posts and HTTPS-Only Mode in the enterprise policy) is a Chrome setting that forces HTTPS wherever possible, and asks for explicit permission from you before connecting to a site insecurely. There may be attackers attempting to interpose on connections on any network, whether that network is a coffee shop, airport, or an Internet backbone. This setting protects users from these attackers reading confidential data and injecting malicious content into otherwise innocuous webpages. This is particularly useful for Advanced Protection users, since in 2023, plaintext HTTP was used as an exploitation vector during the Egyptian election.\n\n\nBeyond Advanced Protection, we previously posted about how our goal is to eventually enable “Always Use Secure Connections” by default for all Chrome users. As we work towards this goal, in the last two years we have quietly been enabling it in more places beyond Advanced Protection, to help protect more users in risky situations, while limiting the number of warnings users might click through:\n\n\nWe added a new variant of the setting that only warns on public sites, and doesn’t warn on local networks or single-label hostnames (e.g. 192.168.0.1, shortlink/, 10.0.0.1). These names often cannot be issued a publicly-trusted HTTPS certificate. This variant protects against most threats—accessing a public website insecurely—but still allows for users to access local sites, which may be on a more trusted network, without seeing a warning. \nWe’ve automatically enabled “Always Use Secure Connections” for public sites in Incognito Mode for the last year, since Chrome 127 in June 2024.\nWe automatically prevent downgrades from HTTPS to plaintext HTTP on sites that Chrome knows you typically access over HTTPS (a heuristic version of the HSTS header), since Chrome 133 in January 2025.Always Use Secure Connections has two modes—warn on insecure public sites, and warn on any insecure site.\n\nAny user can enable “Always Use Secure Connections” in the Chrome Privacy and Security settings, regardless of if they’re using Advanced Protection. Users can choose if they would like to warn on any insecure site, or only insecure public sites. Enterprises can opt their fleet into either mode, and set exceptions using the HTTPSOnlyMode and HTTPAllowlist policies, respectively. Website operators should protect their users' confidentiality, ensure their content is delivered exactly as they intended, and avoid warnings, by deploying HTTPS.Full Site IsolationSite Isolation is a security feature in Chrome that isolates each website into its own rendering OS process. This means that different websites, even if loaded in a single tab of the same browser window, are kept completely separate from each other in memory. This isolation prevents a malicious website from accessing data or code from another website, even if that malicious website manages to exploit a vulnerability in Chrome’s renderer—a second bug to escape the renderer sandbox is required to access other sites. Site isolation improves security, but requires extra memory to have one process per site. Chrome Desktop isolates all sites by default. However, Android is particularly sensitive to memory usage, so for mobile Android form factors, when Advanced Protection is off, Chrome will only isolate a site if a user logs into that site, or if the user submits a form on that site. On Android devices with 4GB+ RAM in Advanced Protection (and on all desktop clients), Chrome will isolate all sites. Full Site Isolation significantly reduces the risk of cross-site data leakage for Advanced Protection users.\nJavaScript Optimizations and Security\nAdvanced Protection reduces the attack surface of Chrome by disabling the higher-level optimizing Javascript compilers inside V8. V8 is Chrome’s high-performance Javascript and WebAssembly engine. The optimizing compilers in V8 make certain websites run faster, however they historically also have been a source of known exploitation of Chrome. Of all the patched security bugs in V8 with known exploitation, disabling the optimizers would have mitigated ~50%. However, the optimizers are why Chrome scores the highest on industry-wide benchmarks such as Speedometer. Disabling the optimizers blocks a large class of exploits, at the cost of causing performance issues for some websites.\n\nJavascript optimizers can be disabled outside of Advanced Protection Mode via the “Javascript optimization & security” Site Setting. The Site Setting also enables users to disable/enable Javascript optimizers on a per-site basis. Disabling these optimizing compilers is not limited to Advanced Protection. Since Chrome 133, we’ve exposed this as a Site Setting that allows users to enable or disable the higher-level optimizing compilers on a per-site basis, as well as change the default.\nSettings -> Privacy and Security -> Javascript optimization and security\n\nThis setting can be controlled by the DefaultJavaScriptOptimizerSetting  enterprise policy, alongside JavaScriptOptimizerAllowedForSites and JavaScriptOptimizerBlockedForSites for managing the allowlist and denylist. Enterprises can use this policy to block access to the optimizer, while still allowlisting1 the SaaS vendors their employees use on a daily basis. It’s available on Android and desktop platforms\n\n\nChrome aims for the default configuration to be secure for all its users, and we’re continuing to raise the bar for V8 security in the default configuration by rolling out the V8 sandbox. \nProtecting All Users\nBillions of people use Chrome and Android, and not all of them have the same risk profile. Less sophisticated attacks by commodity malware can be very lucrative for attackers when done at scale, but so can sophisticated attacks on targeted users. This means that we cannot expect the security tradeoffs we make for the default configuration of Chrome to be suitable for everyone. \n\nAdvanced Protection, and the security settings associated with it, are a way for users with varying risk profiles to tailor Chrome to their security needs, either as an individual at-risk user. Enterprises with a fleet of managed Chrome installations can also enable the underlying settings now. Advanced Protection is available on Android 16 in Chrome 137+. \n\nWe additionally recommend at-risk users join the Advanced Protection Program with their Google accounts, which will require the account to use phishing-resistant multi-factor authentication methods and enable Advanced Protection on any of the user’s Android devices. We also recommend users enable automatic updates and always keep their Android phones and web browsers up to date.\n\nNotes\n     Allowlisting only works on platforms capable of full site isolation—any desktop platform and Android devices with 2GB+ RAM. This is because internally allowlisting is dependent on origin isolation. ↩",
        "published": "2025-07-08"
    },
    {
        "title": "Advisor to Brit tech contractors Qdos confirms client data leak",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/25/ir35_advisor_qdos_confirms_data_breach/",
        "summary": "Policy management not affected, but some personal data may have been snaffled Business insurance and employment status specialist Qdos has confirmed that an intruder has stolen some customers personal data, according to a communication to tech contractors that was seen by The Register.…",
        "published": "2025-07-25"
    },
    {
        "title": "DNS security is important but DNSSEC may be a failed experiment",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/25/systems_approach_column_dns_security/",
        "summary": "Nobody thinks of running a website without HTTPs. Safer DNS still seems optional Systems Approach  Last week I turned on DNSSEC (Domain Name System Security Extensions) for the systemsapproach.org domain. No need to applaud; I was just trying to get an understanding of what the barriers to adoption might be while teaching myself about the technology.…",
        "published": "2025-07-25"
    },
    {
        "title": "Laptop farmer behind $17M North Korean IT worker scam locked up for 8.5 years",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/24/laptop_farmer_north_korean_it_scam_sentenced/",
        "summary": "Plus she has to cough up a slice of Pyongyang’s payday An Arizona woman who ran a laptop farm from her home - helping North Korean IT operatives pose as US-based remote workers - has been sentenced to eight and a half years behind bars for her role in a $17 million fraud that hit more than 300 American companies.…",
        "published": "2025-07-24"
    },
    {
        "title": "Cisco ISE flaw gave root access before fix arrived, say researchers",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/24/no_login_no_problem_cisco_flaw/",
        "summary": "Shadowserver claims miscreants were already poking at a critical hole in early July, long before Switchzilla patched it Threat actors have actively exploited a newly patched vulnerability in Cisco's Identity Services Engine (ISE) software since early July, weeks before the networking giant got around to issuing a fix.…",
        "published": "2025-07-24"
    },
    {
        "title": "UnMarker tool nukes AI provenance tags",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/24/ai_watermarks_unmarker/",
        "summary": "Boffins insist your deepfake tracking tech won't work Computer scientists with the University of Waterloo in Ontario, Canada, say they've developed a way to remove watermarks embedded in AI-generated images.…",
        "published": "2025-07-24"
    },
    {
        "title": "SharePoint attacks now officially include ransomware infections",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/24/microsoft_sharepoint_ransomware/",
        "summary": "Let the games begin Ransomware has officially entered the Microsoft SharePoint exploitation ring.…",
        "published": "2025-07-24"
    },
    {
        "title": "Coyote malware abuses Microsoft's UI Automation to hunt banking creds",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/24/coyote_malware_microsoft_uia/",
        "summary": "Some coyotes hunt squirrels, this one hunts users' financial apps A new variant of the Coyote banking trojan abuses Microsoft's UI Automation (UIA), making it the first reported malware to use UIA for credential theft.… ",
        "published": "2025-07-24"
    },
    {
        "title": "Compromised Amazon Q extension told AI to delete everything – and it shipped",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/24/amazon_q_ai_prompt/",
        "summary": "Malicious actor reportedly sought to expose AWS 'security theater' The official Amazon Q extension for Visual Studio Code (VS Code) was compromised to include a prompt to wipe the user's home directory and delete all their AWS resources.…",
        "published": "2025-07-24"
    },
    {
        "title": "Eau no! Dior tells customers their data was swiped in cyber snafu",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/24/eau_no_dior_tells_customers/",
        "summary": "French fashion house dishes out notices after hackers raided a client database – ShinyHunters suspected Updated  Fashion house Dior has begun dropping data breach notices after cybercrooks with a taste for high-end targets made off with customer data.…",
        "published": "2025-07-24"
    },
    {
        "title": "npm phishing attack laces popular packages with malware",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/24/not_pretty_not_windowsonly_npm/",
        "summary": "The \"is\" package was infected with cross-platform malware after a scam targeting maintainers The popular npm package \"is\" was infected with cross-platform malware, around the same time that linting utility packages used with the prettier code formatter were infected with Windows-only malware.…",
        "published": "2025-07-24"
    },
    {
        "title": "Microsoft SharePoint victim count hits 400+ orgs in ongoing attacks",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/23/microsoft_sharepoint_400_orgs/",
        "summary": "US DOE among breached government agencies More than 400 organizations have been compromised in the Microsoft SharePoint attack, according to Eye Security, which initially sounded the alarm on the mass exploitation last Friday, even before Redmond confirmed the critical vulnerabilities.…",
        "published": "2025-07-23"
    },
    {
        "title": "Copilot Vision on Windows 11 sends data to Microsoft servers",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/23/microsoft_copilot_vision/",
        "summary": "Total Recall: Capturing everything you do on your PC screen to become a 'true companion' Microsoft is again throwing AI at Windows 11 to see what sticks, releasing features including the even more eyebrow-raising successor to its controversial Recall, a screen-streaming remotely processed backseat driver dubbed Copilot Vision.…",
        "published": "2025-07-23"
    },
    {
        "title": "China warns citizens to beware backdoored devices, on land and under the sea",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/23/china_backdoor_alerts/",
        "summary": "Suggests buying local tech to avoid infosec worries China’s Ministry of State Security has spent the week warning of backdoored devices on land and at sea.… ",
        "published": "2025-07-23"
    },
    {
        "title": "Funding for program to stop next Stuxnet from hitting US expired Sunday",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/22/lapsed_cisa_funding_cybersentry/",
        "summary": "CyberSentry work grinds to a halt Government funding for a program that hunts for threats on America's critical infrastructure networks expired on Sunday, preventing Lawrence Livermore National Laboratory from analyzing activity that could indicate a cyberattack, the program director told Congress on Tuesday.…",
        "published": "2025-07-22"
    },
    {
        "title": "Arch Linux users told to purge Firefox forks after AUR malware scare",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/22/arch_aur_browsers_compromised/",
        "summary": "The distro's greatest asset is arguably also its greatest weakness If you installed the Firefox, LibreWolf, or Zen web browsers from the Arch User Repository (AUR) in the last few days, delete them immediately and install fresh copies.…",
        "published": "2025-07-22"
    },
    {
        "title": "Microsoft patches critical SharePoint 2016 zero-days amid active exploits",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/22/microsoft_sharepoint_2016_patch/",
        "summary": "Admins urged to rotate machine keys, restart IIS after emergency fix Microsoft has good news for administrators running SharePoint Server 2016. The cloud and software megacorp has published updates to close a gaping hole in the document management service.…",
        "published": "2025-07-22"
    },
    {
        "title": "Dell scoffs at breach, says miscreants only stole ‘fake data’",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/21/dell_scoffs_at_breach/",
        "summary": "No customer, partner info stolen, spokesperson tells The Reg Dell has confirmed that criminals broke into its IT environment and stole some of its data — but told The Register that it's \"primarily synthetic (fake) data.\"…",
        "published": "2025-07-21"
    },
    {
        "title": "Another massive security snafu hits Microsoft, but don't expect it to stick",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/21/massive_security_snafu_microsoft/",
        "summary": "Move along, nothing to see here comment  Here we go again. Another major Microsoft attack, with this one seeing someone — most likely government-backed hackers — exploiting a zero-day bug in SharePoint Server that Redmond failed to fix.…",
        "published": "2025-07-21"
    },
    {
        "title": "Four new Android spyware samples linked to Iran's intel agency",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/21/muddywaters_android_iran/",
        "summary": "Persians added snooping capabilities to DCHSpy after Israeli bombs fell Four new samples of Android spyware linked to the Iranian Ministry of Intelligence and Security (MOIS) that collects WhatsApp data, records audio and video, and hunts for files by name, surfaced shortly after the Iran-Israel conflict began.…",
        "published": "2025-07-21"
    },
    {
        "title": "Japan discovers object out beyond Pluto that rewrites the Planet 9 theory",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/21/asia_in_brief/",
        "summary": "PLUS: Perplexity AI scores 360-million-customer win in India; Australian billionaire’s political party suffers data breach, won’t contact victims; and more Asia In Brief  Japan’s National Astronomical Observatory last week announced the discovery of a small body with an orbit beyond Pluto’s, and scientists think its presence means the “Planet 9” theory should be revisited.…",
        "published": "2025-07-21"
    },
    {
        "title": "Microsoft patches failed to fix on-prem SharePoint, which is now under zero-day attack",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/21/infosec_in_brief/",
        "summary": "PLUS: China upgrades smartphone surveillance tools; Ring eases anti-snooping stance; and more Infosec In Brief  Microsoft has warned users of SharePoint Server that three on-prem versions of the product include a zero-day flaw that is under attack – and that its own failure to completely fix past problems is the cause.…",
        "published": "2025-07-21"
    },
    {
        "title": "UK uncovers novel Microsoft snooping malware, blames and sanctions GRU cyberspies",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/20/uk_microsoft_snooping_russia/",
        "summary": "Fancy Bear can't keep its claws out of Outlook inboxes The UK government is warning that Russia's APT28 (also known as Fancy Bear or Forest Blizzard) has been deploying previously unknown malware to harvest Microsoft email credentials and steal access to compromised accounts.…",
        "published": "2025-07-20"
    },
    {
        "title": "Ex-IDF cyber chief on Iran, Scattered Spider, and why social engineering worries him more than 0-days",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/19/idf_cyber_chief_iran/",
        "summary": "Keep It Simple, Stupid Interview  Scattered Spider and Iranian government-backed cyber units have more in common than a recent uptick in hacking activity, according to Ariel Parnes, a former colonel in the Israeli Defense Forces' cyber unit 8200.…",
        "published": "2025-07-19"
    },
    {
        "title": "Google sues 25 alleged BadBox 2.0 botnet operators, all of whom are in China",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/17/google_sues_25_unnamed_chinese/",
        "summary": "Ads giant complains of damage to its reputation and finances ... and crime, too Google has filed a lawsuit against 25 unnamed individuals in China it accuses of breaking into more than 10 million devices worldwide and using them to build a botnet, called BadBox 2.0, and then to carry out other cybercrimes and fraud.…",
        "published": "2025-07-17"
    },
    {
        "title": "Ukrainian hackers claim to have destroyed major Russian drone maker's entire network",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/16/ukrainian_drone_attack/",
        "summary": "'Deeply penetrated' Gaskar 'to the very tonsils of demilitarization' Ukrainian hackers claim to have taken out the IT infrastructure at Russia's Gaskar Integration plant, one of the largest suppliers of drones for its army, and also destroyed massive amounts of technical data related to drone production. …",
        "published": "2025-07-16"
    },
    {
        "title": "Operation Eastwood shutters 100+ servers used to DDoS websites supporting Ukraine",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/16/russian_hacktivist_bust/",
        "summary": "Two Russian suspects in cuffs, seven warrants out International cops shut down more than 100 servers belonging to the pro-Russian NoName057(16) network this week as part of the Europol-led Operation Eastwood.…",
        "published": "2025-07-16"
    },
    {
        "title": "Crims hijacking fully patched SonicWall VPNs to deploy stealthy backdoor and rootkit",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/16/sonicwall_vpn_hijack/",
        "summary": "Someone's OVERSTEPing the mark Updated  Unknown miscreants are exploiting fully patched, end-of-life SonicWall VPNs to deploy a previously unknown backdoor and rootkit, likely for data theft and extortion, according to Google's Threat Intelligence Group.…",
        "published": "2025-07-16"
    },
    {
        "title": "Attackers snatched all 6.5M member records",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/16/coop_data_stolen/",
        "summary": "Supermarket announces white hat education scheme as four suspects released on bail Co-op Group's chief executive officer has confirmed that all 6.5 million of the organization's members had their data stolen during its April cyberattack - Scattered Spider is believed to be behind the digital heist.…",
        "published": "2025-07-16"
    },
    {
        "title": "Turbulence at Air Serbia, the latest airline under cyber siege",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/16/air_serbia_cyberattack/",
        "summary": "Attack enters day 11 and still no public disclosure of what insider claims to be 'deep breach' of Active Directory Exclusive  Aviation insiders say Serbia's national airline, Air Serbia, was forced to delay issuing payslips to staff as a result of a cyberattack it is battling.…",
        "published": "2025-07-16"
    },
    {
        "title": "Curl creator mulls nixing bug bounty awards to stop AI slop",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/15/curl_creator_mulls_nixing_bug/",
        "summary": "Maintainers struggle to handle growing flow of low-quality bug reports written by bots Daniel Stenberg, founder and lead developer of the open-source curl command line utility, just wants the AI slop to stop.…",
        "published": "2025-07-15"
    },
    {
        "title": "Ex-US soldier who Googled 'can hacking be treason' pleads guilty to extortion",
        "link": "https://go.theregister.com/feed/www.theregister.com/2025/07/15/solider_hacking_guilty/",
        "summary": "File this one under what not to search if you've committed a crime A former US Army soldier, who reportedly hacked AT&T, bragged about accessing President Donald Trump's call logs, and then Googled \"can hacking be treason,\" and \"US military personnel defecting to Russia,\" pleaded guilty to conspiring to break into telecom firms' databases and extort at least $1 million.…",
        "published": "2025-07-15"
    }
]